Revit 2024 API
BuiltInFailures.ElectricalFailures.FeedThroughLugsIsNotEnabledAndBindFormulaInFamily Property
 Can't change connection type to Feed Through Lugs because Feed Through Lugs is unchecked. Enable Feed Through Lugs with related formula in family editor the Feed Through Lugs is mapped to. Select the panel -> Edit Family -> Family Types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FeedThroughLugsIsNotEnabledAndBindFormulaInFamily { get; }
Visual Basic
Public Shared ReadOnly Property FeedThroughLugsIsNotEnabledAndBindFormulaInFamily As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FeedThroughLugsIsNotEnabledAndBindFormulaInFamily {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace